INTRODUCTION.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-16 Tue 12:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pointless Project</title>
<meta name="author" content="Zachary Haskins" />
<meta name="description" content="Introduction to the Pointless Project" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Pointless Project
<br />
<span class="subtitle">Introduction</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org191aeca">1. Introduction</a></li>
<li><a href="#org1c3825e">2. Current Puzzles</a>
<ul>
<li><a href="#orgc44f5cd">2.1. Math</a></li>
<li><a href="#orge7a0514">2.2. Color</a></li>
<li><a href="#org9d4d92f">2.3. Pixel</a></li>
<li><a href="#orge56b6e4">2.4. Maze</a></li>
<li><a href="#org915e4e0">2.5. Encrypt</a></li>
<li><a href="#org0e620cb">2.6. Based</a></li>
<li><a href="#org040ee40">2.7. Rematches</a>
<ul>
<li><a href="#org8fcfc97">2.7.1. Maze II</a></li>
<li><a href="#orgda84e25">2.7.2. Encrypt II</a></li>
<li><a href="#orga08af8e">2.7.3. Based II</a></li>
</ul>
</li>
<li><a href="#org4781411">2.8. Ast</a></li>
<li><a href="#org486c4f3">2.9. Binary Addition (Graph Paper Robot I)</a></li>
<li><a href="#orgc1876e3">2.10. Logic Gate (Graph Paper Robot II)</a></li>
<li><a href="#org06f9da5">2.11. <span class="todo TODO">TODO</span> (Graph Paper Robot III)</a></li>
</ul>
</li>
<li><a href="#org37a2c5a">3. Issues</a></li>
<li><a href="#orgd31a440">4. Future Plans</a></li>
<li><a href="#org587f19a">5. Contact</a></li>
</ul>
</div>
</div>

<div id="outline-container-org191aeca" class="outline-2">
<h2 id="org191aeca"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The point(less) of the <i>Pointless Project</i> is to provide fun puzzles to future potential students while
teaching them about computer science topics without them realizing it. The project started when the School of Computing
found that it was hard to keep in touch with the hopefully-to-be-students in Computer Science/Software Engineering.
</p>
</div>
</div>

<div id="outline-container-org1c3825e" class="outline-2">
<h2 id="org1c3825e"><span class="section-number-2">2.</span> Current Puzzles</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc44f5cd" class="outline-3">
<h3 id="orgc44f5cd"><span class="section-number-3">2.1.</span> Math</h3>
</div>

<div id="outline-container-orge7a0514" class="outline-3">
<h3 id="orge7a0514"><span class="section-number-3">2.2.</span> Color</h3>
</div>

<div id="outline-container-org9d4d92f" class="outline-3">
<h3 id="org9d4d92f"><span class="section-number-3">2.3.</span> Pixel</h3>
</div>

<div id="outline-container-orge56b6e4" class="outline-3">
<h3 id="orge56b6e4"><span class="section-number-3">2.4.</span> Maze</h3>
</div>

<div id="outline-container-org915e4e0" class="outline-3">
<h3 id="org915e4e0"><span class="section-number-3">2.5.</span> Encrypt</h3>
</div>

<div id="outline-container-org0e620cb" class="outline-3">
<h3 id="org0e620cb"><span class="section-number-3">2.6.</span> Based</h3>
</div>

<div id="outline-container-org040ee40" class="outline-3">
<h3 id="org040ee40"><span class="section-number-3">2.7.</span> Rematches</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org8fcfc97" class="outline-4">
<h4 id="org8fcfc97"><span class="section-number-4">2.7.1.</span> Maze II</h4>
</div>

<div id="outline-container-orgda84e25" class="outline-4">
<h4 id="orgda84e25"><span class="section-number-4">2.7.2.</span> Encrypt II</h4>
</div>

<div id="outline-container-orga08af8e" class="outline-4">
<h4 id="orga08af8e"><span class="section-number-4">2.7.3.</span> Based II</h4>
</div>
</div>

<div id="outline-container-org4781411" class="outline-3">
<h3 id="org4781411"><span class="section-number-3">2.8.</span> Ast</h3>
</div>

<div id="outline-container-org486c4f3" class="outline-3">
<h3 id="org486c4f3"><span class="section-number-3">2.9.</span> Binary Addition (Graph Paper Robot I)</h3>
</div>

<div id="outline-container-orgc1876e3" class="outline-3">
<h3 id="orgc1876e3"><span class="section-number-3">2.10.</span> Logic Gate (Graph Paper Robot II)</h3>
</div>

<div id="outline-container-org06f9da5" class="outline-3">
<h3 id="org06f9da5"><span class="section-number-3">2.11.</span> <span class="todo TODO">TODO</span> (Graph Paper Robot III)</h3>
<div class="outline-text-3" id="text-2-11">
<p>
Currently unimplemented
</p>
</div>
</div>
</div>

<div id="outline-container-org37a2c5a" class="outline-2">
<h2 id="org37a2c5a"><span class="section-number-2">3.</span> Issues</h2>
</div>

<div id="outline-container-orgd31a440" class="outline-2">
<h2 id="orgd31a440"><span class="section-number-2">4.</span> Future Plans</h2>
</div>

<div id="outline-container-org587f19a" class="outline-2">
<h2 id="org587f19a"><span class="section-number-2">5.</span> Contact</h2>
<div class="outline-text-2" id="text-5">
<blockquote>
<p>
Zachary Haskins - <i>zdhdev@yahoo.com</i> <a href="https://github.com/malloc-nbytes/">Github</a> <br />
Turner Austin - <i>tcaustin@mail.lipscomb.edu</i> Github <br />
Mekeal Brown - <i>mtbrown@mail.lipscomb.edu</i> <a href="https://github.com/mekealbrown">Github</a> <br />
Steven Yassa - <i>seyassa@mail.lipscomb.edu</i>
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zachary Haskins</p>
<p class="date">Created: 2024-04-16 Tue 12:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
